bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/stubs/HAL_stubs.c
    }

    return __return;
}

/** User stub definition for function: HAL_StatusTypeDef HAL_TIM_PWM_Init(TIM_HandleTypeDef *) */
EXTERN_C_LINKAGE HAL_StatusTypeDef HAL_TIM_PWM_Init (TIM_HandleTypeDef * htim) ;
EXTERN_C_LINKAGE HAL_StatusTypeDef CppTest_Stub_HAL_TIM_PWM_Init (TIM_HandleTypeDef * htim) 
{
    CPPTEST_STUB_CALLED("HAL_TIM_PWM_Init");

    HAL_StatusTypeDef __return = HAL_OK;

    /**
     * This section enables Dynamic Stub Configuration with Stub Callbacks.
     *
     * IMPORTANT: THIS COMMENT BLOCK SHOULD NOT BE DELETED OR MODIFIED
     *
     * 1. Define stub callback function in test suite file - use the following signature:
     *     void CppTest_StubCallback_SomeName(CppTest_StubCallInfo* stubCallInfo, HAL_StatusTypeDef* __return, TIM_HandleTypeDef * htim)
     *
     * 2. Register stub callback in test case function - use the following code:
     *     CPPTEST_REGISTER_STUB_CALLBACK("HAL_TIM_PWM_Init", &CppTest_StubCallback_SomeName);
     *
     * 3. Fill out the body of the stub callback function according to intent.
     * The following line may be used to call original function inside stub callback:
     *     *__return = HAL_TIM_PWM_Init(htim);
     */
    if (CPPTEST_STUB_HAS_CALLBACK()) {
        CPPTEST_STUB_CALLBACK_PARAMS(HAL_StatusTypeDef* __return, TIM_HandleTypeDef * htim);
        CPPTEST_STUB_INVOKE_CALLBACK(&__return, htim);

    } else if (CPPTEST_STUB_HAS_ORIGINAL_DEFINITION()) {
        __return = HAL_TIM_PWM_Init(htim);

    } else {
        /* You can put additional stub logic here. */

    }

    return __return;
}

/** User stub definition for function: HAL_StatusTypeDef HAL_TIM_PWM_ConfigChannel(TIM_HandleTypeDef *, TIM_OC_InitTypeDef *, uint32_t) */
EXTERN_C_LINKAGE HAL_StatusTypeDef HAL_TIM_PWM_ConfigChannel (TIM_HandleTypeDef * htim, TIM_OC_InitTypeDef * sConfig, uint32_t Channel) ;
EXTERN_C_LINKAGE HAL_StatusTypeDef CppTest_Stub_HAL_TIM_PWM_ConfigChannel (TIM_HandleTypeDef * htim, TIM_OC_InitTypeDef * sConfig, uint32_t Channel) 
{
    CPPTEST_STUB_CALLED("HAL_TIM_PWM_ConfigChannel");

    HAL_StatusTypeDef __return = HAL_OK;

    /**
     * This section enables Dynamic Stub Configuration with Stub Callbacks.
     *
     * IMPORTANT: THIS COMMENT BLOCK SHOULD NOT BE DELETED OR MODIFIED
     *
     * 1. Define stub callback function in test suite file - use the following signature:
     *     void CppTest_StubCallback_SomeName(CppTest_StubCallInfo* stubCallInfo, HAL_StatusTypeDef* __return, TIM_HandleTypeDef * htim, TIM_OC_InitTypeDef * sConfig, uint32_t Channel)
     *
     * 2. Register stub callback in test case function - use the following code:
     *     CPPTEST_REGISTER_STUB_CALLBACK("HAL_TIM_PWM_ConfigChannel", &CppTest_StubCallback_SomeName);
     *
     * 3. Fill out the body of the stub callback function according to intent.
     * The following line may be used to call original function inside stub callback:
     *     *__return = HAL_TIM_PWM_ConfigChannel(htim, sConfig, Channel);
     */
    if (CPPTEST_STUB_HAS_CALLBACK()) {
        CPPTEST_STUB_CALLBACK_PARAMS(HAL_StatusTypeDef* __return, TIM_HandleTypeDef * htim, TIM_OC_InitTypeDef * sConfig, uint32_t Channel);
        CPPTEST_STUB_INVOKE_CALLBACK(&__return, htim, sConfig, Channel);

    } else if (CPPTEST_STUB_HAS_ORIGINAL_DEFINITION()) {
        __return = HAL_TIM_PWM_ConfigChannel(htim, sConfig, Channel);

    } else {
        /* You can put additional stub logic here. */

    }

    return __return;
}

/** User stub definition for function: HAL_StatusTypeDef HAL_ADC_PollForConversion(ADC_HandleTypeDef *, uint32_t) */
EXTERN_C_LINKAGE HAL_StatusTypeDef HAL_ADC_PollForConversion (ADC_HandleTypeDef * hadc, uint32_t Timeout) ;
EXTERN_C_LINKAGE HAL_StatusTypeDef CppTest_Stub_HAL_ADC_PollForConversion (ADC_HandleTypeDef * hadc, uint32_t Timeout) 
{
    CPPTEST_STUB_CALLED("HAL_ADC_PollForConversion");

    HAL_StatusTypeDef __return = HAL_OK;

    /**
     * This section enables Dynamic Stub Configuration with Stub Callbacks.
     *
     * IMPORTANT: THIS COMMENT BLOCK SHOULD NOT BE DELETED OR MODIFIED
     *
     * 1. Define stub callback function in test suite file - use the following signature:
     *     void CppTest_StubCallback_SomeName(CppTest_StubCallInfo* stubCallInfo, HAL_StatusTypeDef* __return, ADC_HandleTypeDef * hadc, uint32_t Timeout)
     *
     * 2. Register stub callback in test case function - use the following code:
     *     CPPTEST_REGISTER_STUB_CALLBACK("HAL_ADC_PollForConversion", &CppTest_StubCallback_SomeName);
     *
     * 3. Fill out the body of the stub callback function according to intent.
     * The following line may be used to call original function inside stub callback:
     *     *__return = HAL_ADC_PollForConversion(hadc, Timeout);
     */
    if (CPPTEST_STUB_HAS_CALLBACK()) {
        CPPTEST_STUB_CALLBACK_PARAMS(HAL_StatusTypeDef* __return, ADC_HandleTypeDef * hadc, uint32_t Timeout);
        CPPTEST_STUB_INVOKE_CALLBACK(&__return, hadc, Timeout);

    } else if (CPPTEST_STUB_HAS_ORIGINAL_DEFINITION()) {
        __return = HAL_ADC_PollForConversion(hadc, Timeout);

    } else {
        /* You can put additional stub logic here. */

    }

    return __return;
}

/** User stub definition for function: uint32_t HAL_ADC_GetValue(ADC_HandleTypeDef *) */
EXTERN_C_LINKAGE uint32_t HAL_ADC_GetValue (ADC_HandleTypeDef * hadc) ;
EXTERN_C_LINKAGE uint32_t CppTest_Stub_HAL_ADC_GetValue (ADC_HandleTypeDef * hadc) 
{
    CPPTEST_STUB_CALLED("HAL_ADC_GetValue");

    uint32_t __return = 0U;

    /**
     * This section enables Dynamic Stub Configuration with Stub Callbacks.
     *
     * IMPORTANT: THIS COMMENT BLOCK SHOULD NOT BE DELETED OR MODIFIED
     *
     * 1. Define stub callback function in test suite file - use the following signature:
     *     void CppTest_StubCallback_SomeName(CppTest_StubCallInfo* stubCallInfo, uint32_t* __return, ADC_HandleTypeDef * hadc)
     *
     * 2. Register stub callback in test case function - use the following code:
     *     CPPTEST_REGISTER_STUB_CALLBACK("HAL_ADC_GetValue", &CppTest_StubCallback_SomeName);
     *
     * 3. Fill out the body of the stub callback function according to intent.
     * The following line may be used to call original function inside stub callback:
     *     *__return = HAL_ADC_GetValue(hadc);
     */
    if (CPPTEST_STUB_HAS_CALLBACK()) {
        CPPTEST_STUB_CALLBACK_PARAMS(uint32_t* __return, ADC_HandleTypeDef * hadc);
        CPPTEST_STUB_INVOKE_CALLBACK(&__return, hadc);

    } else if (CPPTEST_STUB_HAS_ORIGINAL_DEFINITION()) {
        __return = HAL_ADC_GetValue(hadc);

    } else {
        /* You can put additional stub logic here. */

