bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/stubs/HAL_stubs.c
    }

    return __return;
}

/** User stub definition for function: HAL_StatusTypeDef HAL_ADC_Start(ADC_HandleTypeDef *) */
EXTERN_C_LINKAGE HAL_StatusTypeDef HAL_ADC_Start (ADC_HandleTypeDef * hadc) ;
EXTERN_C_LINKAGE HAL_StatusTypeDef CppTest_Stub_HAL_ADC_Start (ADC_HandleTypeDef * hadc) 
{
    CPPTEST_STUB_CALLED("HAL_ADC_Start");

    HAL_StatusTypeDef __return = HAL_OK;

    /**
     * This section enables Dynamic Stub Configuration with Stub Callbacks.
     *
     * IMPORTANT: THIS COMMENT BLOCK SHOULD NOT BE DELETED OR MODIFIED
     *
     * 1. Define stub callback function in test suite file - use the following signature:
     *     void CppTest_StubCallback_SomeName(CppTest_StubCallInfo* stubCallInfo, HAL_StatusTypeDef* __return, ADC_HandleTypeDef * hadc)
     *
     * 2. Register stub callback in test case function - use the following code:
     *     CPPTEST_REGISTER_STUB_CALLBACK("HAL_ADC_Start", &CppTest_StubCallback_SomeName);
     *
     * 3. Fill out the body of the stub callback function according to intent.
     * The following line may be used to call original function inside stub callback:
     *     *__return = HAL_ADC_Start(hadc);
     */
    if (CPPTEST_STUB_HAS_CALLBACK()) {
        CPPTEST_STUB_CALLBACK_PARAMS(HAL_StatusTypeDef* __return, ADC_HandleTypeDef * hadc);
        CPPTEST_STUB_INVOKE_CALLBACK(&__return, hadc);

    } else if (CPPTEST_STUB_HAS_ORIGINAL_DEFINITION()) {
        __return = HAL_ADC_Start(hadc);

    } else {
        /* You can put additional stub logic here. */

    }

    return __return;
}

/** User stub definition for function: HAL_StatusTypeDef HAL_ADC_Stop(ADC_HandleTypeDef *) */
EXTERN_C_LINKAGE HAL_StatusTypeDef HAL_ADC_Stop (ADC_HandleTypeDef * hadc) ;
EXTERN_C_LINKAGE HAL_StatusTypeDef CppTest_Stub_HAL_ADC_Stop (ADC_HandleTypeDef * hadc) 
{
    CPPTEST_STUB_CALLED("HAL_ADC_Stop");

    HAL_StatusTypeDef __return = HAL_OK;

    /**
     * This section enables Dynamic Stub Configuration with Stub Callbacks.
     *
     * IMPORTANT: THIS COMMENT BLOCK SHOULD NOT BE DELETED OR MODIFIED
     *
     * 1. Define stub callback function in test suite file - use the following signature:
     *     void CppTest_StubCallback_SomeName(CppTest_StubCallInfo* stubCallInfo, HAL_StatusTypeDef* __return, ADC_HandleTypeDef * hadc)
     *
     * 2. Register stub callback in test case function - use the following code:
     *     CPPTEST_REGISTER_STUB_CALLBACK("HAL_ADC_Stop", &CppTest_StubCallback_SomeName);
     *
     * 3. Fill out the body of the stub callback function according to intent.
     * The following line may be used to call original function inside stub callback:
     *     *__return = HAL_ADC_Stop(hadc);
     */
    if (CPPTEST_STUB_HAS_CALLBACK()) {
        CPPTEST_STUB_CALLBACK_PARAMS(HAL_StatusTypeDef* __return, ADC_HandleTypeDef * hadc);
        CPPTEST_STUB_INVOKE_CALLBACK(&__return, hadc);

    } else if (CPPTEST_STUB_HAS_ORIGINAL_DEFINITION()) {
        __return = HAL_ADC_Stop(hadc);

    } else {
        /* You can put additional stub logic here. */

    }

    return __return;
}

/** User stub definition for function: HAL_StatusTypeDef HAL_RCC_OscConfig(RCC_OscInitTypeDef *) */
EXTERN_C_LINKAGE HAL_StatusTypeDef HAL_RCC_OscConfig (RCC_OscInitTypeDef * RCC_OscInitStruct) ;
EXTERN_C_LINKAGE HAL_StatusTypeDef CppTest_Stub_HAL_RCC_OscConfig (RCC_OscInitTypeDef * RCC_OscInitStruct) 
{
    CPPTEST_STUB_CALLED("HAL_RCC_OscConfig");

    HAL_StatusTypeDef __return = HAL_OK;

    /**
     * This section enables Dynamic Stub Configuration with Stub Callbacks.
     *
     * IMPORTANT: THIS COMMENT BLOCK SHOULD NOT BE DELETED OR MODIFIED
     *
     * 1. Define stub callback function in test suite file - use the following signature:
     *     void CppTest_StubCallback_SomeName(CppTest_StubCallInfo* stubCallInfo, HAL_StatusTypeDef* __return, RCC_OscInitTypeDef * RCC_OscInitStruct)
     *
     * 2. Register stub callback in test case function - use the following code:
     *     CPPTEST_REGISTER_STUB_CALLBACK("HAL_RCC_OscConfig", &CppTest_StubCallback_SomeName);
     *
     * 3. Fill out the body of the stub callback function according to intent.
     * The following line may be used to call original function inside stub callback:
     *     *__return = HAL_RCC_OscConfig(RCC_OscInitStruct);
     */
    if (CPPTEST_STUB_HAS_CALLBACK()) {
        CPPTEST_STUB_CALLBACK_PARAMS(HAL_StatusTypeDef* __return, RCC_OscInitTypeDef * RCC_OscInitStruct);
        CPPTEST_STUB_INVOKE_CALLBACK(&__return, RCC_OscInitStruct);

    } else if (CPPTEST_STUB_HAS_ORIGINAL_DEFINITION()) {
        __return = HAL_RCC_OscConfig(RCC_OscInitStruct);

    } else {
        /* You can put additional stub logic here. */

    }

    return __return;
}

/** User stub definition for function: HAL_StatusTypeDef HAL_RCC_ClockConfig(RCC_ClkInitTypeDef *, uint32_t) */
EXTERN_C_LINKAGE HAL_StatusTypeDef HAL_RCC_ClockConfig (RCC_ClkInitTypeDef * RCC_ClkInitStruct, uint32_t FLatency) ;
EXTERN_C_LINKAGE HAL_StatusTypeDef CppTest_Stub_HAL_RCC_ClockConfig (RCC_ClkInitTypeDef * RCC_ClkInitStruct, uint32_t FLatency) 
{
    CPPTEST_STUB_CALLED("HAL_RCC_ClockConfig");

    HAL_StatusTypeDef __return = HAL_OK;

    /**
     * This section enables Dynamic Stub Configuration with Stub Callbacks.
     *
     * IMPORTANT: THIS COMMENT BLOCK SHOULD NOT BE DELETED OR MODIFIED
     *
     * 1. Define stub callback function in test suite file - use the following signature:
     *     void CppTest_StubCallback_SomeName(CppTest_StubCallInfo* stubCallInfo, HAL_StatusTypeDef* __return, RCC_ClkInitTypeDef * RCC_ClkInitStruct, uint32_t FLatency)
     *
     * 2. Register stub callback in test case function - use the following code:
     *     CPPTEST_REGISTER_STUB_CALLBACK("HAL_RCC_ClockConfig", &CppTest_StubCallback_SomeName);
     *
     * 3. Fill out the body of the stub callback function according to intent.
     * The following line may be used to call original function inside stub callback:
     *     *__return = HAL_RCC_ClockConfig(RCC_ClkInitStruct, FLatency);
     */
    if (CPPTEST_STUB_HAS_CALLBACK()) {
        CPPTEST_STUB_CALLBACK_PARAMS(HAL_StatusTypeDef* __return, RCC_ClkInitTypeDef * RCC_ClkInitStruct, uint32_t FLatency);
        CPPTEST_STUB_INVOKE_CALLBACK(&__return, RCC_ClkInitStruct, FLatency);

    } else if (CPPTEST_STUB_HAS_ORIGINAL_DEFINITION()) {
        __return = HAL_RCC_ClockConfig(RCC_ClkInitStruct, FLatency);

    } else {
        /* You can put additional stub logic here. */

