bczwartk/ST_Drone_FCU_F401/STM32 FW Project/Official release with BLE Remocon - 170318/stubs/HAL_stubs.c
    }

    return __return;
}

/** User stub definition for function: uint32_t HAL_SYSTICK_Config(uint32_t) */
EXTERN_C_LINKAGE uint32_t HAL_SYSTICK_Config (uint32_t TicksNumb) ;
EXTERN_C_LINKAGE uint32_t CppTest_Stub_HAL_SYSTICK_Config (uint32_t TicksNumb) 
{
    CPPTEST_STUB_CALLED("HAL_SYSTICK_Config");

    uint32_t __return = 0U;

    /**
     * This section enables Dynamic Stub Configuration with Stub Callbacks.
     *
     * IMPORTANT: THIS COMMENT BLOCK SHOULD NOT BE DELETED OR MODIFIED
     *
     * 1. Define stub callback function in test suite file - use the following signature:
     *     void CppTest_StubCallback_SomeName(CppTest_StubCallInfo* stubCallInfo, uint32_t* __return, uint32_t TicksNumb)
     *
     * 2. Register stub callback in test case function - use the following code:
     *     CPPTEST_REGISTER_STUB_CALLBACK("HAL_SYSTICK_Config", &CppTest_StubCallback_SomeName);
     *
     * 3. Fill out the body of the stub callback function according to intent.
     * The following line may be used to call original function inside stub callback:
     *     *__return = HAL_SYSTICK_Config(TicksNumb);
     */
    if (CPPTEST_STUB_HAS_CALLBACK()) {
        CPPTEST_STUB_CALLBACK_PARAMS(uint32_t* __return, uint32_t TicksNumb);
        CPPTEST_STUB_INVOKE_CALLBACK(&__return, TicksNumb);

    } else if (CPPTEST_STUB_HAS_ORIGINAL_DEFINITION()) {
        __return = HAL_SYSTICK_Config(TicksNumb);

    } else {
        /* You can put additional stub logic here. */

    }

    return __return;
}

/** User stub definition for function: void HAL_SYSTICK_CLKSourceConfig(uint32_t) */
EXTERN_C_LINKAGE void HAL_SYSTICK_CLKSourceConfig (uint32_t CLKSource) ;
EXTERN_C_LINKAGE void CppTest_Stub_HAL_SYSTICK_CLKSourceConfig (uint32_t CLKSource) 
{
    CPPTEST_STUB_CALLED("HAL_SYSTICK_CLKSourceConfig");

    /**
     * This section enables Dynamic Stub Configuration with Stub Callbacks.
     *
     * IMPORTANT: THIS COMMENT BLOCK SHOULD NOT BE DELETED OR MODIFIED
     *
     * 1. Define stub callback function in test suite file - use the following signature:
     *     void CppTest_StubCallback_SomeName(CppTest_StubCallInfo* stubCallInfo, uint32_t CLKSource)
     *
     * 2. Register stub callback in test case function - use the following code:
     *     CPPTEST_REGISTER_STUB_CALLBACK("HAL_SYSTICK_CLKSourceConfig", &CppTest_StubCallback_SomeName);
     *
     * 3. Fill out the body of the stub callback function according to intent.
     * The following line may be used to call original function inside stub callback:
     *     HAL_SYSTICK_CLKSourceConfig(CLKSource);
     */
    if (CPPTEST_STUB_HAS_CALLBACK()) {
        CPPTEST_STUB_CALLBACK_PARAMS(uint32_t CLKSource);
        CPPTEST_STUB_INVOKE_CALLBACK(CLKSource);

    } else if (CPPTEST_STUB_HAS_ORIGINAL_DEFINITION()) {
        HAL_SYSTICK_CLKSourceConfig(CLKSource);

    } else {
        /* You can put additional stub logic here. */

    }

}
